[
  {
    "content": "Apollo 11 was the spaceflight that landed the first humans on the Moon, Americans Neil Armstrong and Buzz Aldrin, on July 20, 1969, at 20:18 UTC. Armstrong became the first to step onto the lunar surface six hours later on July 21 at 02:56 UTC.",
    "source": "Wikipedia"
  },
  {
    "content": "The Gadsden Purchase, or Treaty, was an agreement between the United States and Mexico, finalized in 1854, in which the United States agreed to pay Mexico $10 million for a 29,670 square mile portion of Mexico that later became part of Arizona and New Mexico.",
    "source": "history.state.gov"
  },
  {
    "content": "Originally, the site belonged to Echo Bay Technology Group, Omidyar's consulting firm. Omidyar had tried to register the domain name echobay.com, but found it already taken by the Echo Bay Mines, a gold mining company, so he shortened it to his second choice, eBay.com.",
    "source": "wikipedia.org"
  },
  {
    "content": "Muhammad Ali's Early Years and Amateur Career. Cassius Marcellus Clay Jr., the elder son of Cassius Marcellus Clay Sr. (1912-1990) and Odessa Grady Clay (1917-1994), was born on January 17, 1942, in Louisville, Kentucky. It was a red-and-white Schwinn that steered the future heavyweight champion to the sport of boxing.",
    "source": "history.com"
  },
  {
    "content": "The Romans used a unit of distance called the mille passum, which literally translated into \"a thousand paces.\" Since each pace was considered to be five Roman feet—which were a bit shorter than our modern feet—the mile ended up being 5,000 Roman feet, or roughly 4,850 of our modern feet.",
    "source": "mentalfloss.com"
  },
  {
    "content": "Mrs. originated as a contraction of the honorific Mistress, the feminine of Mister, or Master, which was originally applied to both married and unmarried women. The split into Mrs. for married women from Ms. and Miss began during the 17th century.",
    "source": "wikipedia.org"
  },
  {
    "content": "Answer: He was married to Mileva Marić between 1903 and 1919. They had three children, Lieserl (born 1902), Hans Albert (born 1904) and Eduard (born 1910). He married Elsa Löwenthal in 1919 and they lived together until her death in 1936.",
    "source": "nobelprize.org"
  },
  {
    "content": "Straw hats woven in Ecuador, like many other 19th and early 20th century South American goods, were shipped first to the Isthmus of Panama before sailing for their destinations in Asia, the rest of the Americas and Europe, subsequently acquiring a name that reflected their point of international sale, \"Panama hats\"",
    "source": "wikipedia.org"
  },
  {
    "content": "The chicken nugget was invented in the 1950s by Robert C. Baker, a food science professor at Cornell University, and published as unpatented academic work. Dr. Baker's innovations made it possible to form chicken nuggets in any shape.",
    "source": "wikipedia.org"
  },
  {
    "content": "Zeus (Roman Jupiter): Father and ruler of the gods on Mount Olympus, he is the god of the sky and lightning. He once led the young Olympian gods in a rebellion against the older Titans, and he married his sister, Hera (Roman Juno).",
    "source": "web.cn.edu"
  }
]
